[
[
	{
		"id":1,
		"text":"Welcome home, Hercules. I see your adventures have not gone as expected. What is upsetting you? Hercules, please. Put down the knife.",
		"options":[
			{
				"text":"Kill",
				"result":"(Thunder sound plays) Title shows: The Twelve Labors of Hercules",
				"next":2
			},
			{
				"text":"Dont kill",
				"result":"Lame",
				"next":0
			},
			{
				"text":"Someone explain to me how to make bold text in a form",
				"result":"plsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplsplspls",
				"next":-1
			}
		]
	},
	{
		"id":2,
		"text":"You appear on Mount Olympus, the home of the Gods.\nApollo: Welcome, Hercules. You have killed your family. How do you plead?",
		"options":[
			{
				"text":"Guilty",
				"result":"Wise choice. I will give you a simple punishment: Do twelve good deeds. After this, you will be forgiven.",
				"next":3
			},
			{
				"text":"Not guilty",
				"result":"You dare lie to a god, you foolish mortal. For this act, I will punish you severely. Do twelve good deeds. After this, maybe I will forgive you.",
				"next":3
			}
		]
	},
	{
		"id":3,
		"text":"King Eurysthesus: Hercules! Please help us. A giant lion is attacking my poor citizens. We are unable to defeat it, it survives anything we use against it. Will you help us?",
		"options":[
			{
				"text":"Yes, of course I will help",
				"result":"King Eurysthesus: Thank you. The lion is just up ahead.",
				"next":4
			},
			{
				"text":"No. Screw you.",
				"result":"Apollo: Hercules, do your labors or I will kill you.",
				"next":-1
			}
		]
	},
	{
		"id":4,
		"text":"You approach the lion. It is very large, and would be destroying the city if not distracted by an equally large ball of twine.",
		"options":[
			{
				"text":"Shoot the lion with arrows",
				"result":"You shoot the arrows, but they bounce off the lion's hide. The lion retreats into a nearby cave.",
				"next":5
			},
			{
				"text":"Say hello to the lion",
				"result":"The lion scratches you.",
				"next":-2
			}
		]
	},
	{
		"id":5,
		"text":"",
		"options":[
			{
				"text":"Wait at the cave entrance",
				"result":"The giant ball of twine rolls over and crushes you",
				"next":-2
			},
			{
				"text":"Follow it into the cave",
				"result":"You walk into the cave. It is a large space. Skeletons litter the floors. From further down the cave, you hear a roar.",
				"next":6
			}
		]
	},
	{
		"id":6,
		"text":"",
		"options":[
			{
				"text":"Exit the cave. Too scary.",
				"result":"The giant ball of twine hits you in the face and sends you back into the cave.",
				"next":-1
			},
			{
				"text":"Continue further.",
				"result":"You walk through the cave. There is a dripping sound coming from somewhere. You see evidence of the lion’s path; bones on the floor, rocks moved over, the lion. Oh no.",
				"next":7
			},
			{
				"text":"Wait here",
				"result":"The giant ball of twine rolls into the cave and runs you over.",
				"next":-2
			}
		]
	},
	{
		"id":7,
		"text":"",
		"options":[
			{
				"text":"Hit the lion with your club.",
				"result":"Your club does not affect the lion. It swats you with its paw.",
				"next":-2
			},
			{
				"text":"Run.",
				"result":"You run down the cave. The lion chases you. You fall down a chasm and land in a pool of water. The lion tumbles down the chasm after you.",
				"next":8
			}
		]
	},
	{
		"id":8,
		"text":"",
		"options":[
			{
				"text":"Pet the lion.",
				"result":"The lion bites your hand.",
				"next":-2
			},
			{
				"text":"Swim away.",
				"result":"The lion swims after you and attacks",
				"next":-2
			},
			{
				"text":"Jump on the lion’s back.",
				"result":"You wrap your arms around the lion's neck and begin to choke it. It falls into the water, completely unable to breathe. You wait for it to stop moving, which it eventually does. The lion is dead.",
				"next":9
			}
		]
	},
	{
		"id":9,
		"text":"",
		"options":[
			{
				"text":"Pick up it's pelt",
				"result":"You pick up the pelt. Somehow, it magically turned into a coat once the lion was killed. You don the coat and walk out of the cave. You go back to Nemea. The people cheer as you walk victoriously through the streets. You approach King Eurystheus.\nKing Eurystheus: Wow. You actually did it. I really thought that you would die. Dang, that’s impressive. Ha. Probably shouldn’t have said that. Ok goodbye Hercules please don’t hurt me I’m a frail old man I can’t die my people need me I’m sorry Hercules.",
				"next":100
			},
			{
				"text":"Exit",
				"result":"The sun shines. You exit the cave victorious. And then someone shoots you. Then, the giant ball of twine hits you and you fall all the way back through the cave. Should’ve taken the invulnerable pelt.",
				"next":-1
			}
		]
	}
],
[
  {
		"id":1,
		"text":"King Eurystheus: Hello again Hercules. Nemea is once again under attack by another giant monster. Why does this keep happening. I mean, there are other kingdoms in Greece. Anyway, big snake monster thing. Go deal with it.\nYou travel to a familiar town, where the hydra was spotted nearby. You recognize this place. Your nephew lives here. You knock on his door.\nIolaus: Uncle Hercules! OH GOD WAIT NO PLEASE DON’T HURT ME PLEASE!\nHercules: I won’t hurt you. We need to work together to defeat the hydra.\nIolaus: Ok… I may be willing to help you. But I know what you did. You have a history of killing family members.",
		"options":[
			{
				"text":"Kill him",
				"result":"Hercules… Why? Let's pretend that didn’t happen.",
				"next":2
			},
			{
				"text":"Advance on your quest.",
				"result":"",
				"next":2
			}
		]
	},
  {
		"id":2,
		"text":"You proceed on the quest. You hear leaves shuffle while you walk through the forest. You come across a stream. Suddenly, Iolaus screams. You turn around, and he is not there. You draw your club. Suddenly, a serpent head lunges out of the trees. Its jaw clamps on your chest… and does nothing. The pelt worked.",
		"options":[
			{
				"text":"Chase it through the woods.",
				"result":"",
				"next":3
			},
			{
				"text":"Stay here.",
				"result":"Somewhere in the distance, the giant ball of twine is loaded into a catapult. It is fired, and lands on you.",
				"next":-2
			}
		]
	},
  {
		"id":3,
		"text":"You run after it. You hear Iolaus screaming. Suddenly, the hydra stops. Its nine heads stare at you. And then it throws Iolaus. He hits you and you both fall. You get up and help him to his feet.",
		"options":[
			{
				"text":"Attack the hydra.",
				"result":"",
				"next":4
			},
			{
				"text":"Hug the hydra.",
				"result":"The hydra is not a hugger.",
				"next":-2
			}
		]
	},
  {
		"id":4,
		"text":"You bash its head in with your club. It is crushed, but two are regrown. You turn to Iolaus, and hand him a branch from the ground. Iolaus begins creating a fire.",
		"options":[
			{
				"text":"Attack it again.",
				"result":"",
				"next":5
			},
			{
				"text":"Jump in the fire.",
				"result":"Why would you do that? That’s kinda painful.",
				"next":-2
			}
		]
	},
  {
		"id":5,
		"text":"You bash another one of its heads in. This time, Iolaus uses a torch to burn the spot where the head was. It does not regrow. You continue the process for another seven heads. There are only two remaining. The hydra lunges at you, and bites on you again. The cloak prevents it, but you are picked up in the air. You manage to bash one head while it lifts you, and Iolaus burns it. Iolaus takes the burning piece of wood and slices at the hydra’s last neck. You fall to the ground, still in its jaw. The head is no longer attached to the body.",
		"options":[
			{
				"text":"Leave the hydra’s head.",
				"result":"You leave the hydra’s head. Suddenly, Iolaus stabs you. What a jerk.",
				"next":0
			},
			{
				"text":"Take the head.",
				"result":"You pick up the hydra’s head. You carry it back to King Eurystheus.\nKing Eurystheus: Welcome back, Hercules, you’ve somehow survived again. You’re pretty good at this.",
				"next":100
			}
		]
	}
],
[
  {
		"id":1,
		"text":"King Eurystheus: Ok Hercules, next I need you to go kill a deer for no reason. I am just in a murdery mood. It’s the deer of Diana, the Goddess of the hunt so… have fun I suppose.",
		"options":[
			{
				"text":"Accuse him of running out of ideas.",
				"result":"King Eurystheus: I am not out of ideas! You’re out of ideas!",
				"next":-1
			},
			{
				"text":"Just go do it.",
				"result":"",
				"next":2
			}
		]
	},
  {
		"id":2,
		"text":"You walk off into the forest, see the deer, and shoot it with an arrow. Diana appears.\nDiana: Foolish mortal! You dare kill my beautiful pet. I will kill you for this!",
		"options":[
			{
				"text":"Run",
				"result":"",
				"next":3
			},
			{
				"text":"Apologize",
				"result":"You get shot with an arrow.",
				"next":-2
			}
		]
	},
  {
		"id":3,
		"text":"You run. You sprint into the forest as dozens of arrows go by your head.",
		"options":[
			{
				"text":"Continue running",
				"result":"Diana shoots you.",
				"next":-2
			},
			{
				"text":"Explain why you killed the deer.",
				"result":"You explain that Apollo is making you do these labors.\nDiana: Yeah, that sounds like my brother. He’s an idiot.\nShe heals the deer, and allows you to bring it back to King Eurystheus. She also gives you a silver arrow.\nKing Eurystheus: Wow, you’re doing these tasks with incredible speed. S-S-S-Soon I will be reborn.\nHercules: What was that?\nKing Eurystheus: What? I said you were doing these tasks quickly.",
				"next":100
			}
		]
	}
],
[
	{
		"id":1,
		"text":"You travel to Mount Erymanthus. You remember that your friend lives there, the centaur Pholus. You enter his cave, which is filled with centaurs.\nPholus: Hercules, ol’ buddy ol’ pal! How have you been? It’s been too long, my friend. Here, drink some wine.\nYou open the bottle of wine and pour yourself a glass.\nCentaur 1: Hey wait, he drank our wine.\nCentaur 2: I’ve never seen a centaur with two legs. Wait, he isn’t a centaur!\nThe horde of centaurs approach you. You turn to Pholus, but he is hidden behind the counter.",
		"options":[
			{
				"text":"Attack the centaurs",
				"result":"You hit one centaur over the head with your club. You take out your bow and shoot the silver arrow through another one. The arrow quickly returns to your hand. You begin using it as a melee weapon. All of the centaurs are dead.\nPholus: Wow, that is a cool arrow. Can I see it? This looks like it was built by Diana herself! And that enchantment to make it come back to your hand is…\nHe drops it on his hoof and dies instantly. You leave his bar. You use the glass of wine to lure the boar to King Eurystheus.",
				"next":100
			},
			{
				"text":"Drink wine",
				"result":"You don’t handle alcohol well, and now you can’t see straight.",
				"next":-1
			}
		]
	}
],
[
	{
		"id":1,
		"text":"Eurystheus: Welcome back, Hercules. For your next labor, you must clean the stables of my rival king, Augeas. He owns more cattle than any other in all of Greece, and he can’t spend the time to clean it himself. Go over and clean them.\nYou go to King Augeas.\nKing Augeas: Hello mysterious traveler. I hear you have come to clean my stables. I will allow this. However, if you were sent here by my enemy, I will curse you with the worst thing imaginable.",
		"options":[
			{
				"text":"Clean the stables.",
				"result":"",
				"next":2
			},
			{
				"text":"Do a backflip.",
				"result":"What… the heck… why would you do that? I’m genuinely really confused. Why did you think that would accomplish anything?",
				"next":-1
			}
		]
	},
	{
		"id":2,
		"text":"You walk over to the stables. You immediately see just how dirty they are. Also, the cows are not very polite.",
		"options":[
			{
				"text":"Kill the cows",
				"result":"Hercules. Why? Why would you do that?",
				"next":-1
			},
			{
				"text":"Look for a way to clean it.",
				"result":"",
				"next":3
			}
		]
	},
	{
		"id":3,
		"text":"You walk around the stables. You see a nearby stream, although you cannot think of a way to get the water to the stables.",
		"options":[
			{
				"text":"Walk away.",
				"result":"The giant ball of twine hits you again.",
				"next":-1
			},
			{
				"text":"Make a deal with the river.",
				"result":"",
				"next":4
			}
		]
	},
	{
		"id":4,
		"text":"You begin speaking to the river. You ask it to wash up into the stables and clean them. Of course, it being a river, it does not respond. Then, you throw in a coin you had in your pocket. The river explodes. Water rushes up into the stables, cleaning them instantly. When the water returns to the river, you feel a sand dollar in your pocket.",
		"options":[
			{
				"text":"Go tell King Augeas.",
				"result":"",
				"next":5
			},
			{
				"text":"Drown",
				"result":"Ok why do you insist on doing these things?",
				"next":-1
			}
		]
	},
	{
		"id":5,
		"text":"You go back to King Augeas.\nKing Augeas: Welcome back, mysterious stranger. Or should I say, HERCULES! That’s right, I figured out who sent you. Now, you will face THE WRATH OF MY LEGAL TEAM! MUHAHAHAHAHAHA!",
		"options":[
			{
				"text":"Find a lawyer.",
				"result":"You find a lawyer. You are ready for court. You enter a court montage. Unfortunately, there are no visuals in this montage, so you will have to piece it together using out of context voice lines and actions.\n\nKing Augeas: Your honor, I’m mad.\nYour lawyer: Checkmate, idiots.\nThe judge looks concerned.\nThe king’s lawyer: As you can see, this man has no arms.\nYou all have a disco party and begin breakdancing.\nThe Judge: Case dismissed. Hercules wins.\nThe montage ends.\nKing Augeas: Well, I suppose you win. Wait, what was that about a disco party?\nYour lawyer: What happens in the montage stays in the montage.",
				"next":100
			},
			{
				"text":"Self-represent",
				"result":"That is a terrible decision.",
				"next":-1
			}
		]
	}
],
[
  {
		"id":1,
		"text":"King Eurystheus: Hercules! The town of Stymphalos is under attack by man-eating birds! You need to go help them. Luckily, Athena has stopped by to give you a gift.\nAthena: As you know, birds hate sounds. That's why they communicate by singing. They all hate each other. Anyway, in order to scare them off, I have for you a bronze krotala. Basically, it makes noises.",
		"options":[
			{
				"text":"Thank Athena.",
				"result":"",
				"next":2
			},
			{
				"text":"Punch Athena.",
				"result":"Athena is a goddess. She avoids your hand and then stabs you with a spear.",
				"next":-2
			}
		]
	},
  {
		"id":2,
		"text":"Athena: You are welcome, young hero. Now go, the town needs you.\nYou head to the village, and then you see the birds. You take out the krotala, and begin making obnoxious noises. The bird begin flying away.\n",
		"options":[
			{
				"text":"Shoot the birds.",
				"result":"You shoot your silver arrow. It hits one bird and instantly kills it. This time, instead of returning to you, it targets the other birds, killing them quickly. Then, it returns.",
				"next":100
			},
			{
				"text":"Try to hit them with your club.",
				"result":"They’re birds. Really, what did you think would happen?",
				"next":-1
			}
		]
	}
],
[
  {
		"id":1,
		"text":"King Eurystheus: Hercules! A giant bull is terrorizing Greece! AND I DIDN’T CAUSE IT! If anyone is going to set a bull loose on Greece, it's going to be me. Get me that bull.\nYou venture out to Crete, where the bull is going on a rampage.",
		"options":[
			{
				"text":"Draw your club.",
				"result":"",
				"next":2
			},
			{
				"text":"Run.",
				"result":"Giant ball of twine once again hits you.",
				"next":-1
			}
		]
	},
  {
		"id":2,
		"text":"You draw the club. The bull charges you. You do a flip over the bull and knock one of its horns off. You pick the horn up, and jump on the bull’s back. The bull falls to the ground.",
		"options":[
			{
				"text":"Drag it back to the king.",
				"result":"You drag the bull all the way back to the king.\nKing Eurystheus: Thanks.\nHe releases the bull.",
				"next":100
			},
			{
				"text":"Give up",
				"result":"You get an inspirational speech about never giving up.",
				"next":-1
			}
		]
	}
],
[
  {
		"id":1,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
  {
		"id":1,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
  {
		"id":10,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
],
[
  {
		"id":1,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
  {
		"id":1,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
  {
		"id":10,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
],
[
  {
		"id":1,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
  {
		"id":1,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
  {
		"id":10,
		"text":"",
		"options":[
			{
				"text":"",
				"result":"",
				"next":2
			},
			{
				"text":"",
				"result":"",
				"next":-1
			}
		]
	},
]
]
